{
    "Microsoft.Windows.Appraiser.General.ChecksumTotalPictureCount": {
        "description": "This event lists the types of objects and how many of each exist on the client device. This allows for a quick way to ensure that the records present on the server match what is present on the client. The data collected with this event is used to help keep Windows up to date.",
        "DatasourceApplicationFile_19H1": "The count of the number of this particular object type present on this device.",
        "DatasourceApplicationFile_19H1Setup": "The count of the number of this particular object type present on this device.",
        "DatasourceApplicationFile_20H1": "The count of the number of this particular object type present on this device.",
        "DatasourceApplicationFile_20H1Setup": "The count of the number of this particular object type present on this device."
    },
    "TelClientSynthetic.HeartBeat_5": {
        "description": "This event sends data about the health and quality of the diagnostic data from the given device, to help keep Windows up to date. It also enables data analysts to determine how 'trusted' the data is from a given device.",
        "AgentConnectionErrorsCount": "Number of non-timeout errors associated with the host/agent channel.",
        "CensusExitCode": "The last exit code of the Census task.",
        "CensusStartTime": "Time of last Census run.",
        "CensusTaskEnabled": "True if Census is enabled, false otherwise.",
        "CompressedBytesUploaded": "Number of compressed bytes uploaded.",
        "ConsumerDroppedCount": "Number of events dropped at consumer layer of telemetry client.",
        "CriticalDataDbDroppedCount": "Number of critical data sampled events dropped at the database layer.",
        "CriticalDataThrottleDroppedCount": "The number of critical data sampled events that were dropped because of throttling.",
        "CriticalOverflowEntersCounter": "Number of times critical overflow mode was entered in event DB.",
        "DbCriticalDroppedCount": "Total number of dropped critical events in event DB.",
        "DbDroppedCount": "Number of events dropped due to DB fullness.",
        "DbDroppedFailureCount": "Number of events dropped due to DB failures.",
        "DbDroppedFullCount": "Number of events dropped due to DB fullness.",
        "DecodingDroppedCount": "Number of events dropped due to decoding failures.",
        "EnteringCriticalOverflowDroppedCounter": "Number of events dropped due to critical overflow mode being initiated.",
        "EtwDroppedBufferCount": "Number of buffers dropped in the UTC ETW session.",
        "EtwDroppedCount": "Number of events dropped at ETW layer of telemetry client.",
        "EventsPersistedCount": "Number of events that reached the PersistEvent stage.",
        "EventStoreLifetimeResetCounter": "Number of times event DB was reset for the lifetime of UTC.",
        "EventStoreResetCounter": "Number of times event DB was reset.",
        "EventStoreResetSizeSum": "Total size of event DB across all resets reports in this instance.",
        "EventsUploaded": "Number of events uploaded.",
        "Flags": "Flags indicating device state such as network state, battery state, and opt-in state.",
        "FullTriggerBufferDroppedCount": "Number of events dropped due to trigger buffer being full.",
        "HeartBeatSequenceNumber": "The sequence number of this heartbeat.",
        "InvalidHttpCodeCount": "Number of invalid HTTP codes received from contacting Vortex.",
        "LastAgentConnectionError": "Last non-timeout error encountered in the host/agent channel.",
        "LastEventSizeOffender": "Event name of last event which exceeded max event size.",
        "LastInvalidHttpCode": "Last invalid HTTP code received from Vortex.",
        "MaxActiveAgentConnectionCount": "The maximum number of active agents during this heartbeat timeframe.",
        "MaxInUseScenarioCounter": "Soft maximum number of scenarios loaded by UTC.",
        "PreviousHeartBeatTime": "Time of last heartbeat event (allows chaining of events).",
        "PrivacyBlockedCount": "The number of events blocked due to privacy settings or tags.",
        "RepeatedUploadFailureDropped": "Number of events lost due to repeated upload failures for a single buffer.",
        "SettingsHttpAttempts": "Number of attempts to contact OneSettings service.",
        "SettingsHttpFailures": "The number of failures from contacting the OneSettings service.",
        "ThrottledDroppedCount": "Number of events dropped due to throttling of noisy providers.",
        "TopUploaderErrors": "List of top errors received from the upload endpoint.",
        "UploaderDroppedCount": "Number of events dropped at the uploader layer of telemetry client.",
        "UploaderErrorCount": "Number of errors received from the upload endpoint.",
        "VortexFailuresTimeout": "The number of timeout failures received from Vortex.",
        "VortexHttpAttempts": "Number of attempts to contact Vortex.",
        "VortexHttpFailures4xx": "Number of 400-499 error codes received from Vortex.",
        "VortexHttpFailures5xx": "Number of 500-599 error codes received from Vortex.",
        "VortexHttpResponseFailures": "Number of Vortex responses that are not 2XX or 400.",
        "VortexHttpResponsesWithDroppedEvents": "Number of Vortex responses containing at least 1 dropped event."
    }
}